// *** IR Dump After mlir::iree_compiler::IREE::Flow::(anonymous namespace)::FlattenTuplesInCFGPass ***
module  {
  func @predict_ex_dispatch_1(%arg0: tensor<1x225x225x16xf32>, %arg1: tensor<3x3x16x32xf32>) -> tensor<1x112x112x32xf32> attributes {iree.module.export} {
    %0 = "mhlo.convolution"(%arg0, %arg1) {batch_group_count = 1 : i64, dimension_numbers = {input_batch_dimension = 0 : i64, input_feature_dimension = 3 : i64, input_spatial_dimensions = dense<[1, 2]> : tensor<2xi64>, kernel_input_feature_dimension = 2 : i64, kernel_output_feature_dimension = 3 : i64, kernel_spatial_dimensions = dense<[0, 1]> : tensor<2xi64>, output_batch_dimension = 0 : i64, output_feature_dimension = 3 : i64, output_spatial_dimensions = dense<[1, 2]> : tensor<2xi64>}, feature_group_count = 1 : i64, padding = dense<0> : tensor<2x2xi64>, rhs_dilation = dense<1> : tensor<2xi64>, window_strides = dense<2> : tensor<2xi64>} : (tensor<1x225x225x16xf32>, tensor<3x3x16x32xf32>) -> tensor<1x112x112x32xf32>
    return %0 : tensor<1x112x112x32xf32>
  }
}


// *** IR Dump After mlir::iree_compiler::IREE::Flow::LegalizeInputTypesPass ***
module  {
  func @predict_ex_dispatch_1(%arg0: tensor<1x225x225x16xf32>, %arg1: tensor<3x3x16x32xf32>) -> tensor<1x112x112x32xf32> attributes {iree.module.export} {
    %0 = "mhlo.convolution"(%arg0, %arg1) {batch_group_count = 1 : i64, dimension_numbers = {input_batch_dimension = 0 : i64, input_feature_dimension = 3 : i64, input_spatial_dimensions = dense<[1, 2]> : tensor<2xi64>, kernel_input_feature_dimension = 2 : i64, kernel_output_feature_dimension = 3 : i64, kernel_spatial_dimensions = dense<[0, 1]> : tensor<2xi64>, output_batch_dimension = 0 : i64, output_feature_dimension = 3 : i64, output_spatial_dimensions = dense<[1, 2]> : tensor<2xi64>}, feature_group_count = 1 : i64, padding = dense<0> : tensor<2x2xi64>, rhs_dilation = dense<1> : tensor<2xi64>, window_strides = dense<2> : tensor<2xi64>} : (tensor<1x225x225x16xf32>, tensor<3x3x16x32xf32>) -> tensor<1x112x112x32xf32>
    return %0 : tensor<1x112x112x32xf32>
  }
}


// *** IR Dump After mlir::iree_compiler::IREE::Flow::MaterializeExportedReflectionPass ***
func @predict_ex_dispatch_1(%arg0: tensor<1x225x225x16xf32> {iree.reflection = {f_partial = "I18!B14!d1d225d225d16"}}, %arg1: tensor<3x3x16x32xf32> {iree.reflection = {f_partial = "I15!B11!d3d3d16d32"}}) -> (tensor<1x112x112x32xf32> {iree.reflection = {f_partial = "R18!B14!d1d112d112d32"}}) attributes {iree.module.export} {
  %0 = "mhlo.convolution"(%arg0, %arg1) {batch_group_count = 1 : i64, dimension_numbers = {input_batch_dimension = 0 : i64, input_feature_dimension = 3 : i64, input_spatial_dimensions = dense<[1, 2]> : tensor<2xi64>, kernel_input_feature_dimension = 2 : i64, kernel_output_feature_dimension = 3 : i64, kernel_spatial_dimensions = dense<[0, 1]> : tensor<2xi64>, output_batch_dimension = 0 : i64, output_feature_dimension = 3 : i64, output_spatial_dimensions = dense<[1, 2]> : tensor<2xi64>}, feature_group_count = 1 : i64, padding = dense<0> : tensor<2x2xi64>, rhs_dilation = dense<1> : tensor<2xi64>, window_strides = dense<2> : tensor<2xi64>} : (tensor<1x225x225x16xf32>, tensor<3x3x16x32xf32>) -> tensor<1x112x112x32xf32>
  return %0 : tensor<1x112x112x32xf32>
}

// *** IR Dump After mlir::iree_compiler::Shape::(anonymous namespace)::ExpandFunctionDynamicDimsPass ***
func @predict_ex_dispatch_1(%arg0: tensor<1x225x225x16xf32> {iree.reflection = {f_partial = "I18!B14!d1d225d225d16"}}, %arg1: tensor<3x3x16x32xf32> {iree.reflection = {f_partial = "I15!B11!d3d3d16d32"}}) -> (tensor<1x112x112x32xf32> {iree.reflection = {f_partial = "R18!B14!d1d112d112d32"}}) attributes {iree.module.export} {
  %0 = "mhlo.convolution"(%arg0, %arg1) {batch_group_count = 1 : i64, dimension_numbers = {input_batch_dimension = 0 : i64, input_feature_dimension = 3 : i64, input_spatial_dimensions = dense<[1, 2]> : tensor<2xi64>, kernel_input_feature_dimension = 2 : i64, kernel_output_feature_dimension = 3 : i64, kernel_spatial_dimensions = dense<[0, 1]> : tensor<2xi64>, output_batch_dimension = 0 : i64, output_feature_dimension = 3 : i64, output_spatial_dimensions = dense<[1, 2]> : tensor<2xi64>}, feature_group_count = 1 : i64, padding = dense<0> : tensor<2x2xi64>, rhs_dilation = dense<1> : tensor<2xi64>, window_strides = dense<2> : tensor<2xi64>} : (tensor<1x225x225x16xf32>, tensor<3x3x16x32xf32>) -> tensor<1x112x112x32xf32>
  return %0 : tensor<1x112x112x32xf32>
}

// *** IR Dump After mlir::iree_compiler::IREE::Flow::MergeExportedReflectionPass ***
func @predict_ex_dispatch_1(%arg0: tensor<1x225x225x16xf32>, %arg1: tensor<3x3x16x32xf32>) -> tensor<1x112x112x32xf32> attributes {iree.module.export, iree.reflection = {f = "I32!B14!d1d225d225d16B11!d3d3d16d32R18!B14!d1d112d112d32", fv = "1"}} {
  %0 = "mhlo.convolution"(%arg0, %arg1) {batch_group_count = 1 : i64, dimension_numbers = {input_batch_dimension = 0 : i64, input_feature_dimension = 3 : i64, input_spatial_dimensions = dense<[1, 2]> : tensor<2xi64>, kernel_input_feature_dimension = 2 : i64, kernel_output_feature_dimension = 3 : i64, kernel_spatial_dimensions = dense<[0, 1]> : tensor<2xi64>, output_batch_dimension = 0 : i64, output_feature_dimension = 3 : i64, output_spatial_dimensions = dense<[1, 2]> : tensor<2xi64>}, feature_group_count = 1 : i64, padding = dense<0> : tensor<2x2xi64>, rhs_dilation = dense<1> : tensor<2xi64>, window_strides = dense<2> : tensor<2xi64>} : (tensor<1x225x225x16xf32>, tensor<3x3x16x32xf32>) -> tensor<1x112x112x32xf32>
  return %0 : tensor<1x112x112x32xf32>
}

// *** IR Dump After mlir::iree_compiler::(anonymous namespace)::ConvertHLOToLinalgOnTensorsPass ***
func @predict_ex_dispatch_1(%arg0: tensor<1x225x225x16xf32>, %arg1: tensor<3x3x16x32xf32>) -> tensor<1x112x112x32xf32> attributes {iree.module.export, iree.reflection = {f = "I32!B14!d1d225d225d16B11!d3d3d16d32R18!B14!d1d112d112d32", fv = "1"}} {
  %0 = linalg.init_tensor [1, 112, 112, 32] : tensor<1x112x112x32xf32>
  %cst = constant 0.000000e+00 : f32
  %1 = linalg.fill(%0, %cst) : tensor<1x112x112x32xf32>, f32 -> tensor<1x112x112x32xf32> 
  %2 = linalg.conv_2d_input_nhwc_filter_hwcf {dilations = dense<1> : tensor<2xi64>, strides = dense<2> : tensor<2xi64>} ins(%arg0, %arg1 : tensor<1x225x225x16xf32>, tensor<3x3x16x32xf32>) outs(%1 : tensor<1x112x112x32xf32>) -> tensor<1x112x112x32xf32>
  return %2 : tensor<1x112x112x32xf32>
}

// *** IR Dump After LinalgFoldUnitExtentDims ***
func @predict_ex_dispatch_1(%arg0: tensor<1x225x225x16xf32>, %arg1: tensor<3x3x16x32xf32>) -> tensor<1x112x112x32xf32> attributes {iree.module.export, iree.reflection = {f = "I32!B14!d1d225d225d16B11!d3d3d16d32R18!B14!d1d112d112d32", fv = "1"}} {
  %cst = constant 0.000000e+00 : f32
  %0 = linalg.init_tensor [1, 112, 112, 32] : tensor<1x112x112x32xf32>
  %1 = linalg.fill(%0, %cst) : tensor<1x112x112x32xf32>, f32 -> tensor<1x112x112x32xf32> 
  %2 = linalg.conv_2d_input_nhwc_filter_hwcf {dilations = dense<1> : tensor<2xi64>, strides = dense<2> : tensor<2xi64>} ins(%arg0, %arg1 : tensor<1x225x225x16xf32>, tensor<3x3x16x32xf32>) outs(%1 : tensor<1x112x112x32xf32>) -> tensor<1x112x112x32xf32>
  return %2 : tensor<1x112x112x32xf32>
}

// *** IR Dump After Canonicalizer ***
func @predict_ex_dispatch_1(%arg0: tensor<1x225x225x16xf32>, %arg1: tensor<3x3x16x32xf32>) -> tensor<1x112x112x32xf32> attributes {iree.module.export, iree.reflection = {f = "I32!B14!d1d225d225d16B11!d3d3d16d32R18!B14!d1d112d112d32", fv = "1"}} {
  %cst = constant 0.000000e+00 : f32
  %0 = linalg.init_tensor [1, 112, 112, 32] : tensor<1x112x112x32xf32>
  %1 = linalg.fill(%0, %cst) : tensor<1x112x112x32xf32>, f32 -> tensor<1x112x112x32xf32> 
  %2 = linalg.conv_2d_input_nhwc_filter_hwcf {dilations = dense<1> : tensor<2xi64>, strides = dense<2> : tensor<2xi64>} ins(%arg0, %arg1 : tensor<1x225x225x16xf32>, tensor<3x3x16x32xf32>) outs(%1 : tensor<1x112x112x32xf32>) -> tensor<1x112x112x32xf32>
  return %2 : tensor<1x112x112x32xf32>
}

// *** IR Dump After mlir::iree_compiler::(anonymous namespace)::FusionOfTensorOpsPass ***
func @predict_ex_dispatch_1(%arg0: tensor<1x225x225x16xf32>, %arg1: tensor<3x3x16x32xf32>) -> tensor<1x112x112x32xf32> attributes {iree.module.export, iree.reflection = {f = "I32!B14!d1d225d225d16B11!d3d3d16d32R18!B14!d1d112d112d32", fv = "1"}} {
  %cst = constant 0.000000e+00 : f32
  %0 = linalg.init_tensor [1, 112, 112, 32] : tensor<1x112x112x32xf32>
  %1 = linalg.fill(%0, %cst) : tensor<1x112x112x32xf32>, f32 -> tensor<1x112x112x32xf32> 
  %2 = linalg.conv_2d_input_nhwc_filter_hwcf {dilations = dense<1> : tensor<2xi64>, strides = dense<2> : tensor<2xi64>} ins(%arg0, %arg1 : tensor<1x225x225x16xf32>, tensor<3x3x16x32xf32>) outs(%1 : tensor<1x112x112x32xf32>) -> tensor<1x112x112x32xf32>
  return %2 : tensor<1x112x112x32xf32>
}

// *** IR Dump After mlir::iree_compiler::IREE::Flow::(anonymous namespace)::DispatchLinalgOnTensorsPass ***
func @predict_ex_dispatch_1(%arg0: tensor<1x225x225x16xf32>, %arg1: tensor<3x3x16x32xf32>) -> tensor<1x112x112x32xf32> attributes {iree.module.export, iree.reflection = {f = "I32!B14!d1d225d225d16B11!d3d3d16d32R18!B14!d1d112d112d32", fv = "1"}} {
  %c1 = constant 1 : index
  %c32 = constant 32 : index
  %c112 = constant 112 : index
  %0 = flow.dispatch.workgroups[%c32, %c112, %c112, %c1] (%arg0, %arg1) : (tensor<1x225x225x16xf32>, tensor<3x3x16x32xf32>) -> tensor<1x112x112x32xf32> = (%arg2 : !flow.dispatch.input<1x225x225x16xf32>, %arg3 : !flow.dispatch.input<3x3x16x32xf32>, %arg4 : !flow.dispatch.output<1x112x112x32xf32>) {
    %cst = constant 0.000000e+00 : f32
    %c32_0 = constant 32 : index
    %c112_1 = constant 112 : index
    %c3 = constant 3 : index
    %c0 = constant 0 : index
    %c16 = constant 16 : index
    %c1_2 = constant 1 : index
    %1 = linalg.init_tensor [1, 112, 112, 32] : tensor<1x112x112x32xf32>
    %workgroup_size_0 = flow.dispatch.workgroup.size[0] : index
    %workgroup_size_1 = flow.dispatch.workgroup.size[1] : index
    %workgroup_size_2 = flow.dispatch.workgroup.size[2] : index
    %workgroup_size_3 = flow.dispatch.workgroup.size[3] : index
    %workgroup_id_0 = flow.dispatch.workgroup.id[0] : index
    %workgroup_count_0 = flow.dispatch.workgroup.count[0] : index
    %workgroup_id_1 = flow.dispatch.workgroup.id[1] : index
    %workgroup_count_1 = flow.dispatch.workgroup.count[1] : index
    %workgroup_id_2 = flow.dispatch.workgroup.id[2] : index
    %workgroup_count_2 = flow.dispatch.workgroup.count[2] : index
    %workgroup_id_3 = flow.dispatch.workgroup.id[3] : index
    %workgroup_count_3 = flow.dispatch.workgroup.count[3] : index
    %2 = muli %workgroup_size_3, %workgroup_id_3 : index
    %3 = muli %workgroup_size_3, %workgroup_count_3 : index
    scf.for %arg5 = %2 to %c1_2 step %3 {
      %4 = muli %workgroup_size_2, %workgroup_id_2 : index
      %5 = muli %workgroup_size_2, %workgroup_count_2 : index
      scf.for %arg6 = %4 to %c112_1 step %5 {
        %6 = muli %workgroup_size_1, %workgroup_id_1 : index
        %7 = muli %workgroup_size_1, %workgroup_count_1 : index
        scf.for %arg7 = %6 to %c112_1 step %7 {
          %8 = muli %workgroup_size_0, %workgroup_id_0 : index
          %9 = muli %workgroup_size_0, %workgroup_count_0 : index
          scf.for %arg8 = %8 to %c32_0 step %9 {
            %10 = affine.min affine_map<(d0, d1) -> (d1, -d0 + 1)>(%arg5, %workgroup_size_3)
            %11 = affine.apply affine_map<(d0) -> (d0 * 2)>(%arg6)
            %12 = affine.min affine_map<(d0, d1) -> (d0 * 2 + 1, d1 * -2 + 225)>(%workgroup_size_2, %arg6)
            %13 = affine.apply affine_map<(d0) -> (d0 * 2)>(%arg7)
            %14 = affine.min affine_map<(d0, d1) -> (d0 * 2 + 1, d1 * -2 + 225)>(%workgroup_size_1, %arg7)
            %15 = flow.dispatch.input.load %arg2, offsets = [%arg5, %11, %13, %c0], sizes = [%10, %12, %14, %c16], strides = [%c1_2, %c1_2, %c1_2, %c1_2] : !flow.dispatch.input<1x225x225x16xf32> -> tensor<?x?x?x16xf32>
            %16 = affine.min affine_map<(d0, d1) -> (d1, -d0 + 32)>(%arg8, %workgroup_size_0)
            %17 = flow.dispatch.input.load %arg3, offsets = [%c0, %c0, %c0, %arg8], sizes = [%c3, %c3, %c16, %16], strides = [%c1_2, %c1_2, %c1_2, %c1_2] : !flow.dispatch.input<3x3x16x32xf32> -> tensor<3x3x16x?xf32>
            %18 = affine.min affine_map<(d0, d1) -> (d1, -d0 + 1)>(%arg5, %workgroup_size_3)
            %19 = affine.min affine_map<(d0, d1) -> (d1, -d0 + 112)>(%arg6, %workgroup_size_2)
            %20 = affine.min affine_map<(d0, d1) -> (d1, -d0 + 112)>(%arg7, %workgroup_size_1)
            %21 = affine.min affine_map<(d0, d1) -> (d1, -d0 + 32)>(%arg8, %workgroup_size_0)
            %22 = subtensor %1[%arg5, %arg6, %arg7, %arg8] [%18, %19, %20, %21] [1, 1, 1, 1] : tensor<1x112x112x32xf32> to tensor<?x?x?x?xf32>
            %23 = linalg.fill(%22, %cst) : tensor<?x?x?x?xf32>, f32 -> tensor<?x?x?x?xf32> 
            %24 = linalg.conv_2d_input_nhwc_filter_hwcf {__internal_linalg_transform__ = "workgroup", dilations = dense<1> : tensor<2xi64>, iree.codegen.distribution.original_operand_types = [tensor<1x225x225x16xf32>, tensor<3x3x16x32xf32>, tensor<1x112x112x32xf32>], iree.codegen.distribution.original_result_types = [tensor<1x112x112x32xf32>], iree.codegen.fushion.root_op = 0 : i64, strides = dense<2> : tensor<2xi64>} ins(%15, %17 : tensor<?x?x?x16xf32>, tensor<3x3x16x?xf32>) outs(%23 : tensor<?x?x?x?xf32>) -> tensor<?x?x?x?xf32>
            flow.dispatch.output.store %24, %arg4, offsets = [%arg5, %arg6, %arg7, %arg8], sizes = [%18, %19, %20, %21], strides = [%c1_2, %c1_2, %c1_2, %c1_2] : tensor<?x?x?x?xf32> -> !flow.dispatch.output<1x112x112x32xf32>
          }
        }
      }
    }
    flow.return
  }
  return %0 : tensor<1x112x112x32xf32>
}

// *** IR Dump After Canonicalizer ***
#map0 = affine_map<(d0, d1) -> (d1, -d0 + 1)>
#map1 = affine_map<(d0) -> (d0 * 2)>
#map2 = affine_map<(d0, d1) -> (d0 * 2 + 1, d1 * -2 + 225)>
#map3 = affine_map<(d0, d1) -> (d1, -d0 + 32)>
#map4 = affine_map<(d0, d1) -> (d1, -d0 + 112)>
module  {
  func @predict_ex_dispatch_1(%arg0: tensor<1x225x225x16xf32>, %arg1: tensor<3x3x16x32xf32>) -> tensor<1x112x112x32xf32> attributes {iree.module.export, iree.reflection = {f = "I32!B14!d1d225d225d16B11!d3d3d16d32R18!B14!d1d112d112d32", fv = "1"}} {
    %c1 = constant 1 : index
    %c32 = constant 32 : index
    %c112 = constant 112 : index
    %0 = flow.dispatch.workgroups[%c32, %c112, %c112, %c1] (%arg0, %arg1) : (tensor<1x225x225x16xf32>, tensor<3x3x16x32xf32>) -> tensor<1x112x112x32xf32> = (%arg2 : !flow.dispatch.input<1x225x225x16xf32>, %arg3 : !flow.dispatch.input<3x3x16x32xf32>, %arg4 : !flow.dispatch.output<1x112x112x32xf32>) {
      %cst = constant 0.000000e+00 : f32
      %c32_0 = constant 32 : index
      %c112_1 = constant 112 : index
      %c3 = constant 3 : index
      %c0 = constant 0 : index
      %c16 = constant 16 : index
      %c1_2 = constant 1 : index
      %workgroup_size_0 = flow.dispatch.workgroup.size[0] : index
      %workgroup_size_1 = flow.dispatch.workgroup.size[1] : index
      %workgroup_size_2 = flow.dispatch.workgroup.size[2] : index
      %workgroup_size_3 = flow.dispatch.workgroup.size[3] : index
      %workgroup_id_0 = flow.dispatch.workgroup.id[0] : index
      %workgroup_count_0 = flow.dispatch.workgroup.count[0] : index
      %workgroup_id_1 = flow.dispatch.workgroup.id[1] : index
      %workgroup_count_1 = flow.dispatch.workgroup.count[1] : index
      %workgroup_id_2 = flow.dispatch.workgroup.id[2] : index
      %workgroup_count_2 = flow.dispatch.workgroup.count[2] : index
      %workgroup_id_3 = flow.dispatch.workgroup.id[3] : index
      %workgroup_count_3 = flow.dispatch.workgroup.count[3] : index
      %1 = muli %workgroup_size_3, %workgroup_id_3 : index
      %2 = muli %workgroup_size_3, %workgroup_count_3 : index
      scf.for %arg5 = %1 to %c1_2 step %2 {
        %3 = muli %workgroup_size_2, %workgroup_id_2 : index
        %4 = muli %workgroup_size_2, %workgroup_count_2 : index
        scf.for %arg6 = %3 to %c112_1 step %4 {
          %5 = muli %workgroup_size_1, %workgroup_id_1 : index
          %6 = muli %workgroup_size_1, %workgroup_count_1 : index
          scf.for %arg7 = %5 to %c112_1 step %6 {
            %7 = muli %workgroup_size_0, %workgroup_id_0 : index
            %8 = muli %workgroup_size_0, %workgroup_count_0 : index
            scf.for %arg8 = %7 to %c32_0 step %8 {
              %9 = affine.min #map0(%arg5, %workgroup_size_3)
              %10 = affine.apply #map1(%arg6)
              %11 = affine.min #map2(%workgroup_size_2, %arg6)
              %12 = affine.apply #map1(%arg7)
              %13 = affine.min #map2(%workgroup_size_1, %arg7)
              %14 = flow.dispatch.input.load %arg2, offsets = [%arg5, %10, %12, %c0], sizes = [%9, %11, %13, %c16], strides = [%c1_2, %c1_2, %c1_2, %c1_2] : !flow.dispatch.input<1x225x225x16xf32> -> tensor<?x?x?x16xf32>
              %15 = affine.min #map3(%arg8, %workgroup_size_0)
              %16 = flow.dispatch.input.load %arg3, offsets = [%c0, %c0, %c0, %arg8], sizes = [%c3, %c3, %c16, %15], strides = [%c1_2, %c1_2, %c1_2, %c1_2] : !flow.dispatch.input<3x3x16x32xf32> -> tensor<3x3x16x?xf32>
              %17 = affine.min #map0(%arg5, %workgroup_size_3)
              %18 = affine.min #map4(%arg6, %workgroup_size_2)
              %19 = affine.min #map4(%arg7, %workgroup_size_1)
              %20 = affine.min #map3(%arg8, %workgroup_size_0)
              %21 = linalg.init_tensor [%17, %18, %19, %20] : tensor<?x?x?x?xf32>
              %22 = linalg.fill(%21, %cst) : tensor<?x?x?x?xf32>, f32 -> tensor<?x?x?x?xf32> 
              %23 = linalg.conv_2d_input_nhwc_filter_hwcf {__internal_linalg_transform__ = "workgroup", dilations = dense<1> : tensor<2xi64>, iree.codegen.distribution.original_operand_types = [tensor<1x225x225x16xf32>, tensor<3x3x16x32xf32>, tensor<1x112x112x32xf32>], iree.codegen.distribution.original_result_types = [tensor<1x112x112x32xf32>], iree.codegen.fushion.root_op = 0 : i64, strides = dense<2> : tensor<2xi64>} ins(%14, %16 : tensor<?x?x?x16xf32>, tensor<3x3x16x?xf32>) outs(%22 : tensor<?x?x?x?xf32>) -> tensor<?x?x?x?xf32>
              flow.dispatch.output.store %23, %arg4, offsets = [%arg5, %arg6, %arg7, %arg8], sizes = [%17, %18, %19, %20], strides = [%c1_2, %c1_2, %c1_2, %c1_2] : tensor<?x?x?x?xf32> -> !flow.dispatch.output<1x112x112x32xf32>
            }
          }
        }
      }
      flow.return
    }
    return %0 : tensor<1x112x112x32xf32>
  }
}


// *** IR Dump After CSE ***
#map0 = affine_map<(d0, d1) -> (d1, -d0 + 1)>
#map1 = affine_map<(d0) -> (d0 * 2)>
#map2 = affine_map<(d0, d1) -> (d0 * 2 + 1, d1 * -2 + 225)>
#map3 = affine_map<(d0, d1) -> (d1, -d0 + 32)>
#map4 = affine_map<(d0, d1) -> (d1, -d0 + 112)>
module  {
  func @predict_ex_dispatch_1(%arg0: tensor<1x225x225x16xf32>, %arg1: tensor<3x3x16x32xf32>) -> tensor<1x112x112x32xf32> attributes {iree.module.export, iree.reflection = {f = "I32!B14!d1d225d225d16B11!d3d3d16d32R18!B14!d1d112d112d32", fv = "1"}} {
    %c1 = constant 1 : index
    %c32 = constant 32 : index
    %c112 = constant 112 : index
    %0 = flow.dispatch.workgroups[%c32, %c112, %c112, %c1] (%arg0, %arg1) : (tensor<1x225x225x16xf32>, tensor<3x3x16x32xf32>) -> tensor<1x112x112x32xf32> = (%arg2 : !flow.dispatch.input<1x225x225x16xf32>, %arg3 : !flow.dispatch.input<3x3x16x32xf32>, %arg4 : !flow.dispatch.output<1x112x112x32xf32>) {
      %cst = constant 0.000000e+00 : f32
      %c32_0 = constant 32 : index
      %c112_1 = constant 112 : index
      %c3 = constant 3 : index
      %c0 = constant 0 : index
      %c16 = constant 16 : index
      %c1_2 = constant 1 : index
      %workgroup_size_0 = flow.dispatch.workgroup.size[0] : index
      %workgroup_size_1 = flow.dispatch.workgroup.size[1] : index
      %workgroup_size_2 = flow.dispatch.workgroup.size[2] : index
      %workgroup_size_3 = flow.dispatch.workgroup.size[3] : index
      %workgroup_id_0 = flow.dispatch.workgroup.id[0] : index
      %workgroup_count_0 = flow.dispatch.workgroup.count[0] : index
      %workgroup_id_1 = flow.dispatch.workgroup.id[1] : index
      %workgroup_count_1 = flow.dispatch.workgroup.count[1] : index
      %workgroup_id_2 = flow.dispatch.workgroup.id[2] : index
      %workgroup_count_2 = flow.dispatch.workgroup.count[2] : index
      %workgroup_id_3 = flow.dispatch.workgroup.id[3] : index
      %workgroup_count_3 = flow.dispatch.workgroup.count[3] : index
      %1 = muli %workgroup_size_3, %workgroup_id_3 : index
      %2 = muli %workgroup_size_3, %workgroup_count_3 : index
      scf.for %arg5 = %1 to %c1_2 step %2 {
        %3 = muli %workgroup_size_2, %workgroup_id_2 : index
        %4 = muli %workgroup_size_2, %workgroup_count_2 : index
        scf.for %arg6 = %3 to %c112_1 step %4 {
          %5 = muli %workgroup_size_1, %workgroup_id_1 : index
          %6 = muli %workgroup_size_1, %workgroup_count_1 : index
          scf.for %arg7 = %5 to %c112_1 step %6 {
            %7 = muli %workgroup_size_0, %workgroup_id_0 : index
            %8 = muli %workgroup_size_0, %workgroup_count_0 : index
            scf.for %arg8 = %7 to %c32_0 step %8 {
              %9 = affine.min #map0(%arg5, %workgroup_size_3)
              %10 = affine.apply #map1(%arg6)
              %11 = affine.min #map2(%workgroup_size_2, %arg6)
              %12 = affine.apply #map1(%arg7)
              %13 = affine.min #map2(%workgroup_size_1, %arg7)
              %14 = flow.dispatch.input.load %arg2, offsets = [%arg5, %10, %12, %c0], sizes = [%9, %11, %13, %c16], strides = [%c1_2, %c1_2, %c1_2, %c1_2] : !flow.dispatch.input<1x225x225x16xf32> -> tensor<?x?x?x16xf32>
              %15 = affine.min #map3(%arg8, %workgroup_size_0)
              %16 = flow.dispatch.input.load %arg3, offsets = [%c0, %c0, %c0, %arg8], sizes = [%c3, %c3, %c16, %15], strides = [%c1_2, %c1_2, %c1_2, %c1_2] : !flow.dispatch.input<3x3x16x32xf32> -> tensor<3x3x16x?xf32>
              %17 = affine.min #map4(%arg6, %workgroup_size_2)
              %18 = affine.min #map4(%arg7, %workgroup_size_1)
              %19 = linalg.init_tensor [%9, %17, %18, %15] : tensor<?x?x?x?xf32>
              %20 = linalg.fill(%19, %cst) : tensor<?x?x?x?xf32>, f32 -> tensor<?x?x?x?xf32> 
              %21 = linalg.conv_2d_input_nhwc_filter_hwcf {__internal_linalg_transform__ = "workgroup", dilations = dense<1> : tensor<2xi64>, iree.codegen.distribution.original_operand_types = [tensor<1x225x225x16xf32>, tensor<3x3x16x32xf32>, tensor<1x112x112x32xf32>], iree.codegen.distribution.original_result_types = [tensor<1x112x112x32xf32>], iree.codegen.fushion.root_op = 0 : i64, strides = dense<2> : tensor<2xi64>} ins(%14, %16 : tensor<?x?x?x16xf32>, tensor<3x3x16x?xf32>) outs(%20 : tensor<?x?x?x?xf32>) -> tensor<?x?x?x?xf32>
              flow.dispatch.output.store %21, %arg4, offsets = [%arg5, %arg6, %arg7, %arg8], sizes = [%9, %17, %18, %15], strides = [%c1_2, %c1_2, %c1_2, %c1_2] : tensor<?x?x?x?xf32> -> !flow.dispatch.output<1x112x112x32xf32>
            }
          }
        }
      }
      flow.return
    }
    return %0 : tensor<1x112x112x32xf32>
  }
}


// *** IR Dump After mlir::iree_compiler::IREE::Flow::OutlineDispatchRegions2Pass ***
#map0 = affine_map<(d0, d1) -> (d1, -d0 + 1)>
#map1 = affine_map<(d0) -> (d0 * 2)>
#map2 = affine_map<(d0, d1) -> (d0 * 2 + 1, d1 * -2 + 225)>
#map3 = affine_map<(d0, d1) -> (d1, -d0 + 32)>
#map4 = affine_map<(d0, d1) -> (d1, -d0 + 112)>
module  {
  flow.executable @predict_ex_dispatch_1_dispatch_0 attributes {sym_visibility = "private"} {
    flow.dispatch.entry @predict_ex_dispatch_1_dispatch_0 attributes {signature = (tensor<1x225x225x16xf32>, tensor<3x3x16x32xf32>) -> tensor<1x112x112x32xf32>, workgroup_rank = 4 : index}
    module  {
      func @predict_ex_dispatch_1_dispatch_0(%arg0: !flow.dispatch.input<1x225x225x16xf32>, %arg1: !flow.dispatch.input<3x3x16x32xf32>, %arg2: !flow.dispatch.output<1x112x112x32xf32>) {
        %cst = constant 0.000000e+00 : f32
        %c32 = constant 32 : index
        %c112 = constant 112 : index
        %c3 = constant 3 : index
        %c0 = constant 0 : index
        %c16 = constant 16 : index
        %c1 = constant 1 : index
        %workgroup_size_0 = flow.dispatch.workgroup.size[0] : index
        %workgroup_size_1 = flow.dispatch.workgroup.size[1] : index
        %workgroup_size_2 = flow.dispatch.workgroup.size[2] : index
        %workgroup_size_3 = flow.dispatch.workgroup.size[3] : index
        %workgroup_id_0 = flow.dispatch.workgroup.id[0] : index
        %workgroup_count_0 = flow.dispatch.workgroup.count[0] : index
        %workgroup_id_1 = flow.dispatch.workgroup.id[1] : index
        %workgroup_count_1 = flow.dispatch.workgroup.count[1] : index
        %workgroup_id_2 = flow.dispatch.workgroup.id[2] : index
        %workgroup_count_2 = flow.dispatch.workgroup.count[2] : index
        %workgroup_id_3 = flow.dispatch.workgroup.id[3] : index
        %workgroup_count_3 = flow.dispatch.workgroup.count[3] : index
        %0 = muli %workgroup_size_3, %workgroup_id_3 : index
        %1 = muli %workgroup_size_3, %workgroup_count_3 : index
        scf.for %arg3 = %0 to %c1 step %1 {
          %2 = muli %workgroup_size_2, %workgroup_id_2 : index
          %3 = muli %workgroup_size_2, %workgroup_count_2 : index
          scf.for %arg4 = %2 to %c112 step %3 {
            %4 = muli %workgroup_size_1, %workgroup_id_1 : index
            %5 = muli %workgroup_size_1, %workgroup_count_1 : index
            scf.for %arg5 = %4 to %c112 step %5 {
              %6 = muli %workgroup_size_0, %workgroup_id_0 : index
              %7 = muli %workgroup_size_0, %workgroup_count_0 : index
              scf.for %arg6 = %6 to %c32 step %7 {
                %8 = affine.min #map0(%arg3, %workgroup_size_3)
                %9 = affine.apply #map1(%arg4)
                %10 = affine.min #map2(%workgroup_size_2, %arg4)
                %11 = affine.apply #map1(%arg5)
                %12 = affine.min #map2(%workgroup_size_1, %arg5)
                %13 = flow.dispatch.input.load %arg0, offsets = [%arg3, %9, %11, %c0], sizes = [%8, %10, %12, %c16], strides = [%c1, %c1, %c1, %c1] : !flow.dispatch.input<1x225x225x16xf32> -> tensor<?x?x?x16xf32>
                %14 = affine.min #map3(%arg6, %workgroup_size_0)
                %15 = flow.dispatch.input.load %arg1, offsets = [%c0, %c0, %c0, %arg6], sizes = [%c3, %c3, %c16, %14], strides = [%c1, %c1, %c1, %c1] : !flow.dispatch.input<3x3x16x32xf32> -> tensor<3x3x16x?xf32>
                %16 = affine.min #map4(%arg4, %workgroup_size_2)
                %17 = affine.min #map4(%arg5, %workgroup_size_1)
                %18 = linalg.init_tensor [%8, %16, %17, %14] : tensor<?x?x?x?xf32>
                %19 = linalg.fill(%18, %cst) : tensor<?x?x?x?xf32>, f32 -> tensor<?x?x?x?xf32> 
                %20 = linalg.conv_2d_input_nhwc_filter_hwcf {__internal_linalg_transform__ = "workgroup", dilations = dense<1> : tensor<2xi64>, iree.codegen.distribution.original_operand_types = [tensor<1x225x225x16xf32>, tensor<3x3x16x32xf32>, tensor<1x112x112x32xf32>], iree.codegen.distribution.original_result_types = [tensor<1x112x112x32xf32>], iree.codegen.fushion.root_op = 0 : i64, strides = dense<2> : tensor<2xi64>} ins(%13, %15 : tensor<?x?x?x16xf32>, tensor<3x3x16x?xf32>) outs(%19 : tensor<?x?x?x?xf32>) -> tensor<?x?x?x?xf32>
                flow.dispatch.output.store %20, %arg2, offsets = [%arg3, %arg4, %arg5, %arg6], sizes = [%8, %16, %17, %14], strides = [%c1, %c1, %c1, %c1] : tensor<?x?x?x?xf32> -> !flow.dispatch.output<1x112x112x32xf32>
              }
            }
          }
        }
        return
      }
    }
  }
  func @predict_ex_dispatch_1(%arg0: tensor<1x225x225x16xf32>, %arg1: tensor<3x3x16x32xf32>) -> tensor<1x112x112x32xf32> attributes {iree.module.export, iree.reflection = {f = "I32!B14!d1d225d225d16B11!d3d3d16d32R18!B14!d1d112d112d32", fv = "1"}} {
    %c1 = constant 1 : index
    %c32 = constant 32 : index
    %c112 = constant 112 : index
    %0 = flow.dispatch @predict_ex_dispatch_1_dispatch_0::@predict_ex_dispatch_1_dispatch_0[%c32, %c112, %c112, %c1] (%arg0, %arg1) : (tensor<1x225x225x16xf32>, tensor<3x3x16x32xf32>) -> tensor<1x112x112x32xf32>
    return %0 : tensor<1x112x112x32xf32>
  }
}


// *** IR Dump After Canonicalizer ***
func @predict_ex_dispatch_1(%arg0: tensor<1x225x225x16xf32>, %arg1: tensor<3x3x16x32xf32>) -> tensor<1x112x112x32xf32> attributes {iree.module.export, iree.reflection = {f = "I32!B14!d1d225d225d16B11!d3d3d16d32R18!B14!d1d112d112d32", fv = "1"}} {
  %c1 = constant 1 : index
  %c32 = constant 32 : index
  %c112 = constant 112 : index
  %0 = flow.dispatch @predict_ex_dispatch_1_dispatch_0::@predict_ex_dispatch_1_dispatch_0[%c32, %c112, %c112, %c1] (%arg0, %arg1) : (tensor<1x225x225x16xf32>, tensor<3x3x16x32xf32>) -> tensor<1x112x112x32xf32>
  return %0 : tensor<1x112x112x32xf32>
}

// *** IR Dump After Canonicalizer ***
func @predict_ex_dispatch_1(%arg0: tensor<1x225x225x16xf32>, %arg1: tensor<3x3x16x32xf32>) -> tensor<1x112x112x32xf32> attributes {iree.module.export, iree.reflection = {f = "I32!B14!d1d225d225d16B11!d3d3d16d32R18!B14!d1d112d112d32", fv = "1"}} {
  %c1 = constant 1 : index
  %c32 = constant 32 : index
  %c112 = constant 112 : index
  %0 = flow.dispatch @predict_ex_dispatch_1_dispatch_0::@predict_ex_dispatch_1_dispatch_0[%c32, %c112, %c112, %c1] (%arg0, %arg1) : (tensor<1x225x225x16xf32>, tensor<3x3x16x32xf32>) -> tensor<1x112x112x32xf32>
  return %0 : tensor<1x112x112x32xf32>
}

// *** IR Dump After mlir::iree_compiler::IREE::Flow::(anonymous namespace)::HoistUnstreamableOps ***
func @predict_ex_dispatch_1(%arg0: tensor<1x225x225x16xf32>, %arg1: tensor<3x3x16x32xf32>) -> tensor<1x112x112x32xf32> attributes {iree.module.export, iree.reflection = {f = "I32!B14!d1d225d225d16B11!d3d3d16d32R18!B14!d1d112d112d32", fv = "1"}} {
  %c112 = constant 112 : index
  %c32 = constant 32 : index
  %c1 = constant 1 : index
  %0 = flow.dispatch @predict_ex_dispatch_1_dispatch_0::@predict_ex_dispatch_1_dispatch_0[%c32, %c112, %c112, %c1] (%arg0, %arg1) : (tensor<1x225x225x16xf32>, tensor<3x3x16x32xf32>) -> tensor<1x112x112x32xf32>
  return %0 : tensor<1x112x112x32xf32>
}

// *** IR Dump After Canonicalizer ***
func @predict_ex_dispatch_1(%arg0: tensor<1x225x225x16xf32>, %arg1: tensor<3x3x16x32xf32>) -> tensor<1x112x112x32xf32> attributes {iree.module.export, iree.reflection = {f = "I32!B14!d1d225d225d16B11!d3d3d16d32R18!B14!d1d112d112d32", fv = "1"}} {
  %c112 = constant 112 : index
  %c32 = constant 32 : index
  %c1 = constant 1 : index
  %0 = flow.dispatch @predict_ex_dispatch_1_dispatch_0::@predict_ex_dispatch_1_dispatch_0[%c32, %c112, %c112, %c1] (%arg0, %arg1) : (tensor<1x225x225x16xf32>, tensor<3x3x16x32xf32>) -> tensor<1x112x112x32xf32>
  return %0 : tensor<1x112x112x32xf32>
}

// *** IR Dump After mlir::iree_compiler::IREE::Flow::FormStreamsPass ***
func @predict_ex_dispatch_1(%arg0: tensor<1x225x225x16xf32>, %arg1: tensor<3x3x16x32xf32>) -> tensor<1x112x112x32xf32> attributes {iree.module.export, iree.reflection = {f = "I32!B14!d1d225d225d16B11!d3d3d16d32R18!B14!d1d112d112d32", fv = "1"}} {
  %c112 = constant 112 : index
  %c32 = constant 32 : index
  %c1 = constant 1 : index
  %0 = flow.ex.stream.fragment(%arg2 = %c32 : index, %arg3 = %c112 : index, %arg4 = %c1 : index, %arg5 = %arg0 : tensor<1x225x225x16xf32>, %arg6 = %arg1 : tensor<3x3x16x32xf32>) -> tensor<1x112x112x32xf32> {
    %1 = flow.dispatch @predict_ex_dispatch_1_dispatch_0::@predict_ex_dispatch_1_dispatch_0[%arg2, %arg3, %arg3, %arg4] (%arg5, %arg6) : (tensor<1x225x225x16xf32>, tensor<3x3x16x32xf32>) -> tensor<1x112x112x32xf32>
    flow.return %1 : tensor<1x112x112x32xf32>
  }
  return %0 : tensor<1x112x112x32xf32>
}

// *** IR Dump After Canonicalizer ***
func @predict_ex_dispatch_1(%arg0: tensor<1x225x225x16xf32>, %arg1: tensor<3x3x16x32xf32>) -> tensor<1x112x112x32xf32> attributes {iree.module.export, iree.reflection = {f = "I32!B14!d1d225d225d16B11!d3d3d16d32R18!B14!d1d112d112d32", fv = "1"}} {
  %c112 = constant 112 : index
  %c32 = constant 32 : index
  %c1 = constant 1 : index
  %0 = flow.ex.stream.fragment(%arg2 = %c32 : index, %arg3 = %c112 : index, %arg4 = %c1 : index, %arg5 = %arg0 : tensor<1x225x225x16xf32>, %arg6 = %arg1 : tensor<3x3x16x32xf32>) -> tensor<1x112x112x32xf32> {
    %1 = flow.dispatch @predict_ex_dispatch_1_dispatch_0::@predict_ex_dispatch_1_dispatch_0[%arg2, %arg3, %arg3, %arg4] (%arg5, %arg6) : (tensor<1x225x225x16xf32>, tensor<3x3x16x32xf32>) -> tensor<1x112x112x32xf32>
    flow.return %1 : tensor<1x112x112x32xf32>
  }
  return %0 : tensor<1x112x112x32xf32>
}

// *** IR Dump After Canonicalizer ***
#map0 = affine_map<(d0)[s0] -> (s0, -d0 + 1)>
#map1 = affine_map<(d0) -> (d0 * 2)>
#map2 = affine_map<(d0)[s0] -> (s0 * 2 + 1, d0 * -2 + 225)>
#map3 = affine_map<(d0)[s0] -> (s0, -d0 + 32)>
#map4 = affine_map<(d0)[s0] -> (s0, -d0 + 112)>
module  {
  flow.executable @predict_ex_dispatch_1_dispatch_0 attributes {sym_visibility = "private"} {
    flow.dispatch.entry @predict_ex_dispatch_1_dispatch_0 attributes {signature = (tensor<1x225x225x16xf32>, tensor<3x3x16x32xf32>) -> tensor<1x112x112x32xf32>, workgroup_rank = 4 : index}
    module  {
      func @predict_ex_dispatch_1_dispatch_0(%arg0: !flow.dispatch.input<1x225x225x16xf32>, %arg1: !flow.dispatch.input<3x3x16x32xf32>, %arg2: !flow.dispatch.output<1x112x112x32xf32>) {
        %cst = constant 0.000000e+00 : f32
        %c32 = constant 32 : index
        %c112 = constant 112 : index
        %c3 = constant 3 : index
        %c0 = constant 0 : index
        %c16 = constant 16 : index
        %c1 = constant 1 : index
        %workgroup_size_0 = flow.dispatch.workgroup.size[0] : index
        %workgroup_size_1 = flow.dispatch.workgroup.size[1] : index
        %workgroup_size_2 = flow.dispatch.workgroup.size[2] : index
        %workgroup_size_3 = flow.dispatch.workgroup.size[3] : index
        %workgroup_id_0 = flow.dispatch.workgroup.id[0] : index
        %workgroup_count_0 = flow.dispatch.workgroup.count[0] : index
        %workgroup_id_1 = flow.dispatch.workgroup.id[1] : index
        %workgroup_count_1 = flow.dispatch.workgroup.count[1] : index
        %workgroup_id_2 = flow.dispatch.workgroup.id[2] : index
        %workgroup_count_2 = flow.dispatch.workgroup.count[2] : index
        %workgroup_id_3 = flow.dispatch.workgroup.id[3] : index
        %workgroup_count_3 = flow.dispatch.workgroup.count[3] : index
        %0 = muli %workgroup_size_3, %workgroup_id_3 : index
        %1 = muli %workgroup_size_3, %workgroup_count_3 : index
        scf.for %arg3 = %0 to %c1 step %1 {
          %2 = muli %workgroup_size_2, %workgroup_id_2 : index
          %3 = muli %workgroup_size_2, %workgroup_count_2 : index
          scf.for %arg4 = %2 to %c112 step %3 {
            %4 = muli %workgroup_size_1, %workgroup_id_1 : index
            %5 = muli %workgroup_size_1, %workgroup_count_1 : index
            scf.for %arg5 = %4 to %c112 step %5 {
              %6 = muli %workgroup_size_0, %workgroup_id_0 : index
              %7 = muli %workgroup_size_0, %workgroup_count_0 : index
              scf.for %arg6 = %6 to %c32 step %7 {
                %8 = affine.min #map0(%arg3)[%workgroup_size_3]
                %9 = affine.apply #map1(%arg4)
                %10 = affine.min #map2(%arg4)[%workgroup_size_2]
                %11 = affine.apply #map1(%arg5)
                %12 = affine.min #map2(%arg5)[%workgroup_size_1]
                %13 = flow.dispatch.input.load %arg0, offsets = [%arg3, %9, %11, %c0], sizes = [%8, %10, %12, %c16], strides = [%c1, %c1, %c1, %c1] : !flow.dispatch.input<1x225x225x16xf32> -> tensor<?x?x?x16xf32>
                %14 = affine.min #map3(%arg6)[%workgroup_size_0]
                %15 = flow.dispatch.input.load %arg1, offsets = [%c0, %c0, %c0, %arg6], sizes = [%c3, %c3, %c16, %14], strides = [%c1, %c1, %c1, %c1] : !flow.dispatch.input<3x3x16x32xf32> -> tensor<3x3x16x?xf32>
                %16 = affine.min #map4(%arg4)[%workgroup_size_2]
                %17 = affine.min #map4(%arg5)[%workgroup_size_1]
                %18 = linalg.init_tensor [%8, %16, %17, %14] : tensor<?x?x?x?xf32>
                %19 = linalg.fill(%18, %cst) : tensor<?x?x?x?xf32>, f32 -> tensor<?x?x?x?xf32> 
                %20 = linalg.conv_2d_input_nhwc_filter_hwcf {__internal_linalg_transform__ = "workgroup", dilations = dense<1> : tensor<2xi64>, iree.codegen.distribution.original_operand_types = [tensor<1x225x225x16xf32>, tensor<3x3x16x32xf32>, tensor<1x112x112x32xf32>], iree.codegen.distribution.original_result_types = [tensor<1x112x112x32xf32>], iree.codegen.fushion.root_op = 0 : i64, strides = dense<2> : tensor<2xi64>} ins(%13, %15 : tensor<?x?x?x16xf32>, tensor<3x3x16x?xf32>) outs(%19 : tensor<?x?x?x?xf32>) -> tensor<?x?x?x?xf32>
                flow.dispatch.output.store %20, %arg2, offsets = [%arg3, %arg4, %arg5, %arg6], sizes = [%8, %16, %17, %14], strides = [%c1, %c1, %c1, %c1] : tensor<?x?x?x?xf32> -> !flow.dispatch.output<1x112x112x32xf32>
              }
            }
          }
        }
        return
      }
    }
  }
  func @predict_ex_dispatch_1(%arg0: tensor<1x225x225x16xf32>, %arg1: tensor<3x3x16x32xf32>) -> tensor<1x112x112x32xf32> attributes {iree.module.export, iree.reflection = {f = "I32!B14!d1d225d225d16B11!d3d3d16d32R18!B14!d1d112d112d32", fv = "1"}} {
    %c112 = constant 112 : index
    %c32 = constant 32 : index
    %c1 = constant 1 : index
    %0 = flow.ex.stream.fragment(%arg2 = %c32 : index, %arg3 = %c112 : index, %arg4 = %c1 : index, %arg5 = %arg0 : tensor<1x225x225x16xf32>, %arg6 = %arg1 : tensor<3x3x16x32xf32>) -> tensor<1x112x112x32xf32> {
      %1 = flow.dispatch @predict_ex_dispatch_1_dispatch_0::@predict_ex_dispatch_1_dispatch_0[%arg2, %arg3, %arg3, %arg4] (%arg5, %arg6) : (tensor<1x225x225x16xf32>, tensor<3x3x16x32xf32>) -> tensor<1x112x112x32xf32>
      flow.return %1 : tensor<1x112x112x32xf32>
    }
    return %0 : tensor<1x112x112x32xf32>
  }
}


// *** IR Dump After Canonicalizer ***
#map0 = affine_map<(d0)[s0] -> (s0, -d0 + 1)>
#map1 = affine_map<(d0) -> (d0 * 2)>
#map2 = affine_map<(d0)[s0] -> (s0 * 2 + 1, d0 * -2 + 225)>
#map3 = affine_map<(d0)[s0] -> (s0, -d0 + 32)>
#map4 = affine_map<(d0)[s0] -> (s0, -d0 + 112)>
module  {
  flow.executable @predict_ex_dispatch_1_dispatch_0 attributes {sym_visibility = "private"} {
    flow.dispatch.entry @predict_ex_dispatch_1_dispatch_0 attributes {signature = (tensor<1x225x225x16xf32>, tensor<3x3x16x32xf32>) -> tensor<1x112x112x32xf32>, workgroup_rank = 4 : index}
    module  {
      func @predict_ex_dispatch_1_dispatch_0(%arg0: !flow.dispatch.input<1x225x225x16xf32>, %arg1: !flow.dispatch.input<3x3x16x32xf32>, %arg2: !flow.dispatch.output<1x112x112x32xf32>) {
        %cst = constant 0.000000e+00 : f32
        %c32 = constant 32 : index
        %c112 = constant 112 : index
        %c3 = constant 3 : index
        %c0 = constant 0 : index
        %c16 = constant 16 : index
        %c1 = constant 1 : index
        %workgroup_size_0 = flow.dispatch.workgroup.size[0] : index
        %workgroup_size_1 = flow.dispatch.workgroup.size[1] : index
        %workgroup_size_2 = flow.dispatch.workgroup.size[2] : index
        %workgroup_size_3 = flow.dispatch.workgroup.size[3] : index
        %workgroup_id_0 = flow.dispatch.workgroup.id[0] : index
        %workgroup_count_0 = flow.dispatch.workgroup.count[0] : index
        %workgroup_id_1 = flow.dispatch.workgroup.id[1] : index
        %workgroup_count_1 = flow.dispatch.workgroup.count[1] : index
        %workgroup_id_2 = flow.dispatch.workgroup.id[2] : index
        %workgroup_count_2 = flow.dispatch.workgroup.count[2] : index
        %workgroup_id_3 = flow.dispatch.workgroup.id[3] : index
        %workgroup_count_3 = flow.dispatch.workgroup.count[3] : index
        %0 = muli %workgroup_size_3, %workgroup_id_3 : index
        %1 = muli %workgroup_size_3, %workgroup_count_3 : index
        scf.for %arg3 = %0 to %c1 step %1 {
          %2 = muli %workgroup_size_2, %workgroup_id_2 : index
          %3 = muli %workgroup_size_2, %workgroup_count_2 : index
          scf.for %arg4 = %2 to %c112 step %3 {
            %4 = muli %workgroup_size_1, %workgroup_id_1 : index
            %5 = muli %workgroup_size_1, %workgroup_count_1 : index
            scf.for %arg5 = %4 to %c112 step %5 {
              %6 = muli %workgroup_size_0, %workgroup_id_0 : index
              %7 = muli %workgroup_size_0, %workgroup_count_0 : index
              scf.for %arg6 = %6 to %c32 step %7 {
                %8 = affine.min #map0(%arg3)[%workgroup_size_3]
                %9 = affine.apply #map1(%arg4)
                %10 = affine.min #map2(%arg4)[%workgroup_size_2]
                %11 = affine.apply #map1(%arg5)
                %12 = affine.min #map2(%arg5)[%workgroup_size_1]
                %13 = flow.dispatch.input.load %arg0, offsets = [%arg3, %9, %11, %c0], sizes = [%8, %10, %12, %c16], strides = [%c1, %c1, %c1, %c1] : !flow.dispatch.input<1x225x225x16xf32> -> tensor<?x?x?x16xf32>
                %14 = affine.min #map3(%arg6)[%workgroup_size_0]
                %15 = flow.dispatch.input.load %arg1, offsets = [%c0, %c0, %c0, %arg6], sizes = [%c3, %c3, %c16, %14], strides = [%c1, %c1, %c1, %c1] : !flow.dispatch.input<3x3x16x32xf32> -> tensor<3x3x16x?xf32>
                %16 = affine.min #map4(%arg4)[%workgroup_size_2]
                %17 = affine.min #map4(%arg5)[%workgroup_size_1]
                %18 = linalg.init_tensor [%8, %16, %17, %14] : tensor<?x?x?x?xf32>
                %19 = linalg.fill(%18, %cst) : tensor<?x?x?x?xf32>, f32 -> tensor<?x?x?x?xf32> 
                %20 = linalg.conv_2d_input_nhwc_filter_hwcf {__internal_linalg_transform__ = "workgroup", dilations = dense<1> : tensor<2xi64>, iree.codegen.distribution.original_operand_types = [tensor<1x225x225x16xf32>, tensor<3x3x16x32xf32>, tensor<1x112x112x32xf32>], iree.codegen.distribution.original_result_types = [tensor<1x112x112x32xf32>], iree.codegen.fushion.root_op = 0 : i64, strides = dense<2> : tensor<2xi64>} ins(%13, %15 : tensor<?x?x?x16xf32>, tensor<3x3x16x?xf32>) outs(%19 : tensor<?x?x?x?xf32>) -> tensor<?x?x?x?xf32>
                flow.dispatch.output.store %20, %arg2, offsets = [%arg3, %arg4, %arg5, %arg6], sizes = [%8, %16, %17, %14], strides = [%c1, %c1, %c1, %c1] : tensor<?x?x?x?xf32> -> !flow.dispatch.output<1x112x112x32xf32>
              }
            }
          }
        }
        return
      }
    }
  }
  func @predict_ex_dispatch_1(%arg0: tensor<1x225x225x16xf32>, %arg1: tensor<3x3x16x32xf32>) -> tensor<1x112x112x32xf32> attributes {iree.module.export, iree.reflection = {f = "I32!B14!d1d225d225d16B11!d3d3d16d32R18!B14!d1d112d112d32", fv = "1"}} {
    %c112 = constant 112 : index
    %c32 = constant 32 : index
    %c1 = constant 1 : index
    %0 = flow.ex.stream.fragment(%arg2 = %c32 : index, %arg3 = %c112 : index, %arg4 = %c1 : index, %arg5 = %arg0 : tensor<1x225x225x16xf32>, %arg6 = %arg1 : tensor<3x3x16x32xf32>) -> tensor<1x112x112x32xf32> {
      %1 = flow.dispatch @predict_ex_dispatch_1_dispatch_0::@predict_ex_dispatch_1_dispatch_0[%arg2, %arg3, %arg3, %arg4] (%arg5, %arg6) : (tensor<1x225x225x16xf32>, tensor<3x3x16x32xf32>) -> tensor<1x112x112x32xf32>
      flow.return %1 : tensor<1x112x112x32xf32>
    }
    return %0 : tensor<1x112x112x32xf32>
  }
}


// *** IR Dump After mlir::iree_compiler::IREE::HAL::MaterializeInterfacesPass ***
#map0 = affine_map<(d0)[s0] -> (s0, -d0 + 1)>
#map1 = affine_map<(d0) -> (d0 * 2)>
#map2 = affine_map<(d0)[s0] -> (s0 * 2 + 1, d0 * -2 + 225)>
#map3 = affine_map<(d0)[s0] -> (s0, -d0 + 32)>
#map4 = affine_map<(d0)[s0] -> (s0, -d0 + 112)>
module  {
  hal.executable @predict_ex_dispatch_1_dispatch_0 attributes {sym_visibility = "private"} {
    hal.interface @legacy_io {
      hal.interface.binding @arg0, set=0, binding=0, type="StorageBuffer", access="Read"
      hal.interface.binding @arg1, set=0, binding=1, type="StorageBuffer", access="Read"
      hal.interface.binding @ret0, set=0, binding=2, type="StorageBuffer", access="Write|Discard"
    }
    hal.executable.target @vulkan_spirv, filter="vulkan*" {
      hal.executable.entry_point @predict_ex_dispatch_1_dispatch_0 attributes {interface = @legacy_io, ordinal = 0 : i32, signature = (!flow.dispatch.input<1x225x225x16xf32>, !flow.dispatch.input<3x3x16x32xf32>, !flow.dispatch.output<1x112x112x32xf32>) -> (), workload_rank = 4 : index}
      module attributes {spv.target_env = #spv.target_env<#spv.vce<v1.3, [Shader, Float16, Int16, Int8, StorageBuffer16BitAccess, StorageUniform16, StoragePushConstant16, StorageBuffer8BitAccess, UniformAndStorageBuffer8BitAccess, StoragePushConstant8, GroupNonUniform, VariablePointers, VariablePointersStorageBuffer], [SPV_KHR_16bit_storage, SPV_KHR_8bit_storage, SPV_KHR_storage_buffer_storage_class, SPV_KHR_variable_pointers]>, ARM:IntegratedGPU, {cooperative_matrix_properties_nv = [], max_compute_shared_memory_size = 32768 : i32, max_compute_workgroup_invocations = 512 : i32, max_compute_workgroup_size = dense<512> : vector<3xi32>, subgroup_size = 16 : i32}>}  {
        func @predict_ex_dispatch_1_dispatch_0() {
          %c0 = constant 0 : index
          %0 = hal.interface.binding.subspan @legacy_io::@arg0[%c0] : !flow.dispatch.input<1x225x225x16xf32>
          %1 = hal.interface.binding.subspan @legacy_io::@arg1[%c0] : !flow.dispatch.input<3x3x16x32xf32>
          %2 = hal.interface.binding.subspan @legacy_io::@ret0[%c0] : !flow.dispatch.output<1x112x112x32xf32>
          %cst = constant 0.000000e+00 : f32
          %c32 = constant 32 : index
          %c112 = constant 112 : index
          %c3 = constant 3 : index
          %c0_0 = constant 0 : index
          %c16 = constant 16 : index
          %c1 = constant 1 : index
          %workgroup_size_0 = flow.dispatch.workgroup.size[0] : index
          %workgroup_size_1 = flow.dispatch.workgroup.size[1] : index
          %workgroup_size_2 = flow.dispatch.workgroup.size[2] : index
          %workgroup_size_3 = flow.dispatch.workgroup.size[3] : index
          %workgroup_id_0 = flow.dispatch.workgroup.id[0] : index
          %workgroup_count_0 = flow.dispatch.workgroup.count[0] : index
          %workgroup_id_1 = flow.dispatch.workgroup.id[1] : index
          %workgroup_count_1 = flow.dispatch.workgroup.count[1] : index
          %workgroup_id_2 = flow.dispatch.workgroup.id[2] : index
          %workgroup_count_2 = flow.dispatch.workgroup.count[2] : index
          %workgroup_id_3 = flow.dispatch.workgroup.id[3] : index
          %workgroup_count_3 = flow.dispatch.workgroup.count[3] : index
          %3 = muli %workgroup_size_3, %workgroup_id_3 : index
          %4 = muli %workgroup_size_3, %workgroup_count_3 : index
          scf.for %arg0 = %3 to %c1 step %4 {
            %5 = muli %workgroup_size_2, %workgroup_id_2 : index
            %6 = muli %workgroup_size_2, %workgroup_count_2 : index
            scf.for %arg1 = %5 to %c112 step %6 {
              %7 = muli %workgroup_size_1, %workgroup_id_1 : index
              %8 = muli %workgroup_size_1, %workgroup_count_1 : index
              scf.for %arg2 = %7 to %c112 step %8 {
                %9 = muli %workgroup_size_0, %workgroup_id_0 : index
                %10 = muli %workgroup_size_0, %workgroup_count_0 : index
                scf.for %arg3 = %9 to %c32 step %10 {
                  %11 = affine.min #map0(%arg0)[%workgroup_size_3]
                  %12 = affine.apply #map1(%arg1)
                  %13 = affine.min #map2(%arg1)[%workgroup_size_2]
                  %14 = affine.apply #map1(%arg2)
                  %15 = affine.min #map2(%arg2)[%workgroup_size_1]
                  %16 = flow.dispatch.input.load %0, offsets = [%arg0, %12, %14, %c0_0], sizes = [%11, %13, %15, %c16], strides = [%c1, %c1, %c1, %c1] : !flow.dispatch.input<1x225x225x16xf32> -> tensor<?x?x?x16xf32>
                  %17 = affine.min #map3(%arg3)[%workgroup_size_0]
                  %18 = flow.dispatch.input.load %1, offsets = [%c0_0, %c0_0, %c0_0, %arg3], sizes = [%c3, %c3, %c16, %17], strides = [%c1, %c1, %c1, %c1] : !flow.dispatch.input<3x3x16x32xf32> -> tensor<3x3x16x?xf32>
                  %19 = affine.min #map4(%arg1)[%workgroup_size_2]
                  %20 = affine.min #map4(%arg2)[%workgroup_size_1]
                  %21 = linalg.init_tensor [%11, %19, %20, %17] : tensor<?x?x?x?xf32>
                  %22 = linalg.fill(%21, %cst) : tensor<?x?x?x?xf32>, f32 -> tensor<?x?x?x?xf32> 
                  %23 = linalg.conv_2d_input_nhwc_filter_hwcf {__internal_linalg_transform__ = "workgroup", dilations = dense<1> : tensor<2xi64>, iree.codegen.distribution.original_operand_types = [tensor<1x225x225x16xf32>, tensor<3x3x16x32xf32>, tensor<1x112x112x32xf32>], iree.codegen.distribution.original_result_types = [tensor<1x112x112x32xf32>], iree.codegen.fushion.root_op = 0 : i64, strides = dense<2> : tensor<2xi64>} ins(%16, %18 : tensor<?x?x?x16xf32>, tensor<3x3x16x?xf32>) outs(%22 : tensor<?x?x?x?xf32>) -> tensor<?x?x?x?xf32>
                  flow.dispatch.output.store %23, %2, offsets = [%arg0, %arg1, %arg2, %arg3], sizes = [%11, %19, %20, %17], strides = [%c1, %c1, %c1, %c1] : tensor<?x?x?x?xf32> -> !flow.dispatch.output<1x112x112x32xf32>
                }
              }
            }
          }
          return
        }
        hal.interface @legacy_io attributes {sym_visibility = "private"} {
          hal.interface.binding @arg0, set=0, binding=0, type="StorageBuffer", access="Read"
          hal.interface.binding @arg1, set=0, binding=1, type="StorageBuffer", access="Read"
          hal.interface.binding @ret0, set=0, binding=2, type="StorageBuffer", access="Write|Discard"
        }
      }
    }
  }
  func @predict_ex_dispatch_1(%arg0: tensor<1x225x225x16xf32>, %arg1: tensor<3x3x16x32xf32>) -> tensor<1x112x112x32xf32> attributes {iree.module.export, iree.reflection = {f = "I32!B14!d1d225d225d16B11!d3d3d16d32R18!B14!d1d112d112d32", fv = "1"}} {
    %c112 = constant 112 : index
    %c32 = constant 32 : index
    %c1 = constant 1 : index
